public class LearningData6 {
    public static void main(String[] args){
        //学习位运算符
        //按位与运算
        int a=9 , b=3;
        //a的编码是1001，b的编码是0011
        int c1=a&b;
        System.out.println(c1);//c1的编码是0001，所以c1=1
        //按位或运算
        int c2=a|b;
        System.out.println(c2);//c2的编码是1011，所以c2=11
        //按位异或运算
        int c3=a^b;
        System.out.println(c3);//c3的编码是1010，不同为1相同为0，所以c3=10
        //按位取反运算
        int c4=127;
        int c5=~127;//127的编码是01111111
        System.out.println(c5);//按位取反后编码为10000000，代表十进制的-128
        //位移运算符
        int d=1;//1的编码为00000001
        int d1=d << 1 ;//编码变为00000010，即每一位都向左位移一位
        System.out.println(d1);//编码00000010转化成十进制是2，二进制向左移动1位相当于十进制数字×2，同理左移两位就是×2的二次方，右移同理
        //左移右移不会影响数据的符号，因为填充是根据正负号填充的
        //但>>>代表的无符号右移全部用0填充空位，所以会将负数变成整数
        /*1	()	左→右
          2	~ ! + -<br>(强制类型转换) ++ --	右→左
          3	* / %	左→右
          4	+ -	左→右
          5	<< >> >>>	左→右
          6	&	左→右
          7	^	左→右
          8	|	左→右
          9	= += -= *= /= %=<br>&= |= ^= <<= >>= >>>=	右→左
         */
    }
}
